{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file involved in the Valentine app.",
  "frontend/index.css": "Base Tailwind setup defining CSS variables, themes, and light/dark mode color tokens.",
  "frontend/index.html": "Basic HTML shell loading the React app entrypoint.",
  "frontend/src/App.tsx": "Main React component managing app state transitions, spicy mode, and rendering question/yes/no screens.",
  "frontend/src/components/valentine/CelebrationHearts.tsx": "Animated floating hearts component that displays transient celebratory heart visuals.",
  "frontend/src/components/valentine/FunQuestionsFlow.tsx": "Interactive multi-question component with selectable options and personalized responses.",
  "frontend/src/components/valentine/NoPlayfulState.tsx": "Playful escalating 'No' response screen showing persuasive messages and a prominent Yes button.",
  "frontend/src/components/valentine/QuestionExtras.tsx": "Provides toggleable spicy mode plus buttons revealing randomized sweet notes, spicy jokes, and optional heart/kiss tap overlays.",
  "frontend/src/components/valentine/QuestionState.tsx": "Renders the main Valentine question card with moving 'No' button logic, heart animations, and extras including spicy mode.",
  "frontend/src/components/valentine/TapHeartsOverlay.tsx": "Displays a tappable area that spawns temporary animated heart icons at tap locations.",
  "frontend/src/components/valentine/TapKissesOverlay.tsx": "Creates kiss-mark images at tap positions within a tappable overlay and removes them after animation.",
  "frontend/src/components/valentine/YesSuccessState.tsx": "Shows the success screen with animated hearts, date ideas, reward passes, and optional fun questions after a 'Yes' response.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are needed for the client-side app.",
  "frontend/src/hooks/useSpicyMode.ts": "Manages persistent spicy mode state using localStorage with a toggle function.",
  "frontend/src/index.css": "Defines Tailwind base layers, custom OKLCH color variables for light/dark romantic themes, global styles, and several custom animation keyframes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider, rendering App into the root element.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended romantic color tokens, container settings, fonts, and plugin integrations.",
  "project_state.json": "Stores project metadata, versioning, and a list of implemented Valentine‑themed interactive features and requirements."
}